app/controllers/stocks_controller.rb

SELECT "stocks".* FROM "stocks"
---
    def index
        stocks = Stock.all

SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def show
        stock = Stock.find(params[:id])