app/controllers/users_controller.rb

SELECT "watchlist_records".* FROM "watchlist_records" WHERE "watchlist_records"."user_id" = ?  [["user_id", 1]]
---
    def show
        watchlist_record = WatchlistRecord.where(user_id: params[:id])
        watchlist_record_hash = watchlist_record.map do |record|

INSERT INTO "users" ("name", "username", "password_digest", "total_balance", "buying_power", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        # Save a new user to the database with their username, encrypted password, and balance
        user = User.create!(user_params)