app/controllers/watchlist_records_controller.rb

    def index
        watchlist_records = WatchlistRecord.all
---
SELECT "watchlist_records".* FROM "watchlist_records"

    def current_user
        @current_user ||= User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]